aroyer-qc/GRBL_Digini_STM32Fx/module/Digini/Peripheral/src/port/STM32F7xx/lib_class_STM32F7_sdio.cpp
//-------------------------------------------------------------------------------------------------
//
//  File : lib_class_STM32F7_sdio.cpp
//
//-------------------------------------------------------------------------------------------------
//
// Copyright(c) 2020 Alain Royer.
// Email: aroyer.qc@gmail.com
//
// Permission is hereby granted, free of charge, to any person obtaining a copy of this software
// and associated documentation files (the "Software"), to deal in the Software without
// restriction, including without limitation the rights to use, copy, modify, merge, publish,
// distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the
// Software is furnished to do so, subject to the following conditions:
//
// The above copyright notice and this permission notice shall be included in all copies or
// substantial portions of the Software.
//
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
// INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
// AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
// DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
//
//-------------------------------------------------------------------------------------------------
//
// Notes:
//
//          SD_Detect-Pin
//          SDIO_D0  = SD-Card DAT0
//          SDIO_D1  = SD-Card DAT1
//          SDIO_D2  = SD-Card DAT2
//          SDIO_D3  = SD-Card DAT3/CD
//          SDIO_CK  = SD-Card Clock
//          SDIO_CMD = SD-Card CMD
//
//          DMA : either  DMA2_STREAM3_CHANNEL4
//                   or   DMA2_STREAM6_CHANNEL4
//
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
// Include file(s)
//-------------------------------------------------------------------------------------------------

#include "digini_cfg.h"
#ifdef DIGINI_USE_SDIO
#include <stdint.h>
#define STM32F7_SDIO_GLOBAL
#include "lib_class_sdio.h"
#undef  STM32F7_SDIO_GLOBAL
#include "lib_dma.h"
#include "nOS.h"
#include "stm32f7xx_ll_sdmmc.h"
#include "string.h"
#include "lib_io.h"

//-------------------------------------------------------------------------------------------------
// define(s)
//-------------------------------------------------------------------------------------------------

#define SD_DATA_TIMEOUT                 ((uint32_t)0xFFFFFFFF)
#define SD_SOFTWARE_COMMAND_TIMEOUT     ((uint32_t)0x00010000)

// stuff to change
#define SD_CARD_RETRY_TIMER             (1000 / SD_CARD_TICK_PERIOD)
#define SD_CARD_TICK_PERIOD             1


#define ClearAllFlag()                  { SDMMC1->ICR = (SDMMC_FLAG_CCRCFAIL | SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_CTIMEOUT | \
                                                         SDMMC_FLAG_DTIMEOUT | SDMMC_FLAG_TXUNDERR | SDMMC_FLAG_RXOVERR  | \
                                                         SDMMC_FLAG_CMDREND  | SDMMC_FLAG_CMDSENT  | SDMMC_FLAG_DATAEND  | \
                                                         SDMMC_FLAG_DBCKEND); }

// ----- MMC/SDC command -----
#define ACMD                            0x80
#define CMD0                            (0)                             // GO_IDLE_STATE
#define CMD1                            (1)                             // SEND_OP_COND (MMC)
#define CMD2                            (2)                             // ALL_SEND_CID
#define CMD3                            (3)                             // SEND_RELATIVE_ADDR
#define CMD6                            (6)                             // SET_BUS_WIDTH (SDC)
#define CMD7                            (7)                             // SELECT_CARD
#define CMD8                            (8)                             // SEND_IF_COND
#define CMD9                            (9)                             // SEND_CSD
#define CMD10                           (10)                            // SEND_CID
#define CMD12                           (12)                            // STOP_TRANSMISSION
#define CMD13                           (13)                            // SEND_STATUS
// #define ACMD13                       (55)(13)                        // SD_STATUS (SDC)
#define CMD16                           (16)                            // SET_BLOCKLEN
#define CMD17                           (17)                            // READ_SINGLE_BLOCK
#define CMD18                           (18)                            // READ_MULTIPLE_BLOCK
#define CMD23                           (23)                            // SET_BLK_COUNT (MMC)
//#define ACMD23                        (55)(23)                        // SET_WR_BLK_ERASE_COUNT (SDC)
#define CMD24                           (24)                            // WRITE_BLOCK
#define CMD25                           (25)                            // WRITE_MULTIPLE_BLOCK
#define CMD32                           (32)                            // ERASE_ER_BLK_START
#define CMD33                           (33)                            // ERASE_ER_BLK_END
#define CMD38                           (38)                            // ERASE
#define CMD41                           (41)                            // SEND_OP_COND (SDC)
//#define ACMD41                        (55)(41)                        // SEND_OP_COND (SDC)
#define CMD51                           (51)                            // SEND_SCR
//#define ACMD51                        (55)(51)                        // SEND_SCR
#define CMD55                           (55)                            // APP_CMD


#define SD_OCR_ADDR_OUT_OF_RANGE        ((uint32_t)0x80000000)
#define SD_OCR_ADDR_MISALIGNED          ((uint32_t)0x40000000)
#define SD_OCR_BLOCK_LEN_ERR            ((uint32_t)0x20000000)
#define SD_OCR_ERASE_SEQ_ERR            ((uint32_t)0x10000000)
#define SD_OCR_BAD_ERASE_PARAM          ((uint32_t)0x08000000)
#define SD_OCR_WRITE_PROT_VIOLATION     ((uint32_t)0x04000000)
#define SD_OCR_LOCK_UNLOCK_FAILED       ((uint32_t)0x01000000)
#define SD_OCR_COM_CRC_FAILED           ((uint32_t)0x00800000)
#define SD_OCR_ILLEGAL_CMD              ((uint32_t)0x00400000)
#define SD_OCR_CARD_ECC_FAILED          ((uint32_t)0x00200000)
#define SD_OCR_CC_ERROR                 ((uint32_t)0x00100000)
#define SD_OCR_GENERAL_UNKNOWN_ERROR    ((uint32_t)0x00080000)
#define SD_OCR_STREAM_READ_UNDERRUN     ((uint32_t)0x00040000)
#define SD_OCR_STREAM_WRITE_OVERRUN     ((uint32_t)0x00020000)
#define SD_OCR_CID_CSD_OVERWRITE        ((uint32_t)0x00010000)
#define SD_OCR_WP_ERASE_SKIP            ((uint32_t)0x00008000)
#define SD_OCR_CARD_ECC_DISABLED        ((uint32_t)0x00004000)
#define SD_OCR_ERASE_RESET              ((uint32_t)0x00002000)
#define SD_OCR_AKE_SEQ_ERROR            ((uint32_t)0x00000008)
#define SD_OCR_ERRORBITS                ((uint32_t)0xFDFFE008)
#define SD_R6_GENERAL_UNKNOWN_ERROR     ((uint32_t)0x00002000)
#define SD_R6_ILLEGAL_CMD               ((uint32_t)0x00004000)
#define SD_R6_COM_CRC_FAILED            ((uint32_t)0x00008000)


#define SD_SHORT_RESPONSE               SDMMC_CMD_WAITRESP_0
#define SD_LONG_RESPONSE                SDMMC_CMD_WAITRESP


#define SD_BUS_WIDE_1B                  ((uint32_t)0x00000000)
#define SD_BUS_WIDE_4B                  SDMMC_CLKCR_WIDBUS_0
#define SD_BUS_WIDE_8B                  SDMMC_CLKCR_WIDBUS_1



#define SD_DETECT_GPIO_PORT             GPIOC
#define SD_DETECT_GPIO_CLOCK            RCC_AHB1ENR_GPIOCEN
#define SD_DETECT_PIN                     GPIO_PIN_MASK_13

#define SD_WIDE_BUS_SUPPORT             ((uint32_t)0x00040000)
#define SD_SINGLE_BUS_SUPPORT           ((uint32_t)0x00010000)
#define SD_CARD_LOCKED                  ((uint32_t)0x02000000)
#define SD_VOLTAGE_WINDOW               ((uint32_t)0x80100000)
#define SD_RESP_HIGH_CAPACITY           ((uint32_t)0x40000000)
#define SD_RESP_STD_CAPACITY            ((uint32_t)0x00000000)
#define SD_MAX_VOLT_TRIAL               ((uint32_t)0x0000FFFF)
#define SD_ALLZERO                      ((uint32_t)0x00000000)
#define SD_CHECK_PATTERN                ((uint32_t)0x000001AA)


#define SD_DATABLOCK_SIZE_8B            (SDMMC_DCTRL_DBLOCKSIZE_0|SDMMC_DCTRL_DBLOCKSIZE_1)
#define SD_DATABLOCK_SIZE_64B           (SDMMC_DCTRL_DBLOCKSIZE_1|SDMMC_DCTRL_DBLOCKSIZE_2)
#define SD_DATABLOCK_SIZE_512B          (SDMMC_DCTRL_DBLOCKSIZE_0|SDMMC_DCTRL_DBLOCKSIZE_3)

