aroyer-qc/GRBL_Digini_STM32Fx/module/Digini/Peripheral/src/port/STM32F7xx/lib_class_STM32F7_sdio.cpp
#define BLOCK_SIZE                      512
//#define DMA_CHANNEL_4                   ((uint32_t)0x08000000)                // already define
//#define DMA_MEMORY_TO_PERIPH            ((uint32_t)DMA_SxCR_DIR_0)
//#define DMA_MINC_ENABLE                 ((uint32_t)DMA_SxCR_MINC)
//#define DMA_MDATAALIGN_WORD             ((uint32_t)DMA_SxCR_MSIZE_1)
//#define DMA_PDATAALIGN_WORD             ((uint32_t)DMA_SxCR_PSIZE_1)
//#define DMA_PRIORITY_VERY_HIGH          ((uint32_t)DMA_SxCR_PL)
//#define DMA_MBURST_INC4                 ((uint32_t)DMA_SxCR_MBURST_0)
//#define DMA_PBURST_INC4                 ((uint32_t)DMA_SxCR_PBURST_0)

#define IFCR_CLEAR_MASK_STREAM3         (DMA_LIFCR_CTCIF3 | DMA_LIFCR_CHTIF3 | DMA_LIFCR_CTEIF3 | DMA_LIFCR_CDMEIF3 | DMA_LIFCR_CFEIF3)
#define IFCR_CLEAR_MASK_STREAM6         (DMA_HIFCR_CTCIF6 | DMA_HIFCR_CHTIF6 | DMA_HIFCR_CTEIF6 | DMA_HIFCR_CDMEIF6 | DMA_HIFCR_CFEIF6)

//-------------------------------------------------------------------------------------------------
// typedef(s)
//-------------------------------------------------------------------------------------------------

enum SD_CardState_t
{
    SD_CARD_READY                  = ((uint32_t)0x00000001),  // Card state is ready
    SD_CARD_IDENTIFICATION         = ((uint32_t)0x00000002),  // Card is in identification state
    SD_CARD_STANDBY                = ((uint32_t)0x00000003),  // Card is in standby state
    SD_CARD_TRANSFER               = ((uint32_t)0x00000004),  // Card is in transfer state
    SD_CARD_SENDING                = ((uint32_t)0x00000005),  // Card is sending an operation
    SD_CARD_RECEIVING              = ((uint32_t)0x00000006),  // Card is receiving operation information
    SD_CARD_PROGRAMMING            = ((uint32_t)0x00000007),  // Card is in programming state
    SD_CARD_DISCONNECTED           = ((uint32_t)0x00000008),  // Card is disconnected
    SD_CARD_ERROR                  = ((uint32_t)0x000000FF)   // Card is in error state
};

//-------------------------------------------------------------------------------------------------
//
//   Constructor:   SDIO_Driver
//
//   Parameter(s):  None
//
//   Description:   Initializes the IO and the peripheral
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
SDIO_Driver::SDIO_Driver()
{
    uint32_t PriorityGroup;

    nOS_MutexCreate(&m_Mutex, NOS_MUTEX_RECURSIVE, NOS_MUTEX_PRIO_INHERIT);


    // Reset SDIO Module
    RCC->APB2RSTR |=  RCC_APB2RSTR_SDMMC1RST;
    RCC->APB2RSTR &= ~RCC_APB2RSTR_SDMMC1RST;

    // Enable SDIO clock
    RCC->APB2ENR |= RCC_APB2ENR_SDMMC1EN;

    // Enable DMA2 clocks
    RCC->AHB1ENR |= RCC_AHB1ENR_DMA2EN;


    /// ---- GPIOs Configuration ----
    for(uint32_t IO_Id = uint32_t(IO_SD_D0); IO_Id <= uint32_t(IO_SD_CMD); IO_Id++)
    {
        IO_PinInit(IO_ID_e(IO_Id));
    }

  #if SD_CARD_USE_DETECT_SIGNAL == 1
    IO_PinInit(IO_DETECT_SD_CARD);
  #endif

  #if SD_CARD_USE_POWER_CONTROL == 1
    IO_OutputInit(IO_POWER_SD_CARD);
  #endif


    // Initialize DMA2 channel 3 for RX from SD CARD
    DMA2_Stream3->CR   = 0;                                                 // Reset DMA Stream control register
    DMA2_Stream3->PAR  = (uint32_t)&SDMMC1->FIFO;
    DMA2->LIFCR        = IFCR_CLEAR_MASK_STREAM3;                           // Clear all interrupt flags
    DMA2_Stream3->CR   = (DMA_CHANNEL_4         | DMA_SxCR_PFCTRL        |  // Prepare the DMA Stream configuration
                          DMA_MEMORY_INCREMENT  | DMA_P_DATA_ALIGN_WORD  |  // And write to DMA Stream CR register
                          DMA_M_DATA_ALIGN_WORD | DMA_PRIORITY_VERY_HIGH |
                          DMA_M_BURST_INC4      | DMA_P_BURST_INC4);

    DMA2_Stream3->FCR  = (DMA_SxFCR_DMDIS | DMA_SxFCR_FTH);                 // Configuration FIFO control register

    // Initialize DMA2 channel 6 for TX to SD CARD
    DMA2_Stream6->CR   = 0;                                                 // Reset DMA Stream control register
    DMA2_Stream6->PAR  = (uint32_t)&SDMMC1->FIFO;
    DMA2->HIFCR        = IFCR_CLEAR_MASK_STREAM6;                           // Clear all interrupt flags
    DMA2_Stream6->CR   = (DMA_CHANNEL_4         | DMA_SxCR_PFCTRL        |  // Prepare the DMA Stream configuration
                          DMA_MEMORY_INCREMENT  | DMA_P_DATA_ALIGN_WORD  |  // And write to DMA Stream CR register
                          DMA_M_DATA_ALIGN_WORD | DMA_PRIORITY_VERY_HIGH |
                          DMA_M_BURST_INC4      | DMA_P_BURST_INC4       |
                          DMA_MEMORY_TO_PERIPH);
    DMA2_Stream6->FCR  = (DMA_SxFCR_DMDIS | DMA_SxFCR_FTH);                 // Configuration FIFO control register

    m_CardStatus       = STA_NOINIT;
    m_TransferError    = SYS_READY;
    m_DMA_XferComplete = false;
    m_TransferComplete = false;

    //m_SendStopTransfer = false;
    // m_TickPeriod   = SD_CARD_TICK_PERIOD;

    PriorityGroup = NVIC_GetPriorityGrouping();

    // NVIC configuration for SDIO interrupts
    NVIC_SetPriority(SDMMC1_IRQn, NVIC_EncodePriority(PriorityGroup, 5, 0));
    NVIC_EnableIRQ(SDMMC1_IRQn);

    // NVIC configuration for DMA transfer complete interrupt
    NVIC_SetPriority(DMA2_Stream3_IRQn, NVIC_EncodePriority(PriorityGroup, 6, 0));
    NVIC_EnableIRQ(DMA2_Stream3_IRQn);

    NVIC_SetPriority(DMA2_Stream6_IRQn, NVIC_EncodePriority(PriorityGroup, 6, 0));
    NVIC_EnableIRQ(DMA2_Stream6_IRQn);
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: GetStatus
//
//   Parameter(s):  uint32_t*       pResponse
//   Return value:  SystemState_e
//
//   Description:   Get response from SD device
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
SystemState_e SDIO_Driver::GetStatus(void)
{
    SystemState_e  State;
    uint32_t       Response1;
    SD_CardState_t CardState;

    if((State = this->IsDetected()) == SYS_READY)
    {
        if((State = this->TransmitCommand((CMD13 | SD_SHORT_RESPONSE), m_RCA, 1)) == SYS_READY)
        {
            Response1 = SDMMC1->RESP1;
            CardState = (SD_CardState_t)((Response1 >> 9) & 0x0F);

            // Find SD status according to card state
            if     (CardState == SD_CARD_TRANSFER)  State = SYS_READY;
            else if(CardState == SD_CARD_ERROR)     State = SYS_DEVICE_ERROR;
            else                                    State = SYS_DEVICE_BUSY;
        }
        else
        {
            State = SYS_DEVICE_ERROR;
        }
    }

