aroyer-qc/GRBL_Digini_STM32Fx/module/Digini/Peripheral/src/port/STM32F7xx/lib_class_STM32F7_sdio.cpp
    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: FatFS_Status
//
//   Parameter(s):  None
//   Return value:  DSTATUS
//
//   Description:   Get Status from SD Card
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
DSTATUS SDIO_Driver::FatFS_DiskStatus(void)
{
    // Check SDCARD status
    m_CardStatus = (this->GetStatus() == SYS_READY) ? SYS_READY : STA_NOINIT;
    return (DSTATUS)m_CardStatus;
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: FatFS_Initialize
//
//   Parameter(s):  None
//   Return value:  DSTATUS
//
//   Description:   Initialize SD Card
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
DSTATUS SDIO_Driver::FatFS_Initialize(void)
{
    SystemState_e  State;

    this->PowerOFF();

    // Check if SD card is present
    if(this->IsDetected() == SYS_DEVICE_NOT_PRESENT)
    {
        return STA_NOINIT;
    }

    // Initialize SDMMC peripheral interface with default configuration for SD card initialization
    SDMMC1->CLKCR &= ~(uint32_t)CLKCR_CLEAR_MASK;
    SDMMC1->CLKCR |=  (uint32_t)SDMMC_INIT_CLK_DIV;

    if((State = this->PowerON()) == SYS_READY)                                              // Identify card operating voltage
    {
        if((State = this->InitializeCard()) == SYS_READY)                                   // Initialize the present card and put them in idle state
        {
            if((State = this->GetCardInfo()) == SYS_READY)                                  // Read CSD/CID MSD registers
            {
                State = this->TransmitCommand((CMD7 | SD_SHORT_RESPONSE), m_RCA, 1);        // Select the Card
                SDMMC1->CLKCR &= ~(uint32_t)CLKCR_CLEAR_MASK;                               // Configure SDMMC peripheral interface
            }
        }
    }

    // Configure SD Bus width
    if(State == SYS_READY)
    {
        // Enable wide operation
        State = this->SetBusWidth(SD_BUS_WIDE_4B);
    }

    // Configure the SDCARD device
    m_CardStatus = (State == SYS_READY) ? SYS_READY : STA_NOINIT;
    return (DSTATUS)m_CardStatus;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:       FatFS_Read
//
//   Parameter(s):  uint8_t*  pBuffer
//                  uint32_t  Sector
//                  uint8_t   NumberOfBlocks
//   Return value:  DRESULT
//
//   Description:   Read From SD Card
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
DRESULT SDIO_Driver::FatFS_Read(uint8_t* pBuffer, uint32_t Sector, uint8_t NumberOfBlocks)
{
    // Prepare the DMA Transfer
    this->StartBlockTransfert(DMA2_Stream3, (uint32_t *)pBuffer, BLOCK_SIZE, NumberOfBlocks);

    // Read block(s) in DMA transfer mode
    if(this->ReadBlocks((uint64_t)(Sector * BLOCK_SIZE), BLOCK_SIZE, NumberOfBlocks) == SYS_READY)
    {
        // Wait until transfer is complete
        if(this->CheckOperation(SDMMC_STA_RXACT) == SYS_READY)
        {
            return RES_OK;
        }
    }

    return RES_ERROR;
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: FatFS_Write
//
//   Parameter(s):  const uint8_t*  pBuffer
//                  uint32_t        Sector
//                  uint8_t         NumberOfBlocks
//   Return value:  DRESULT
//
//   Description:   Write to the SD Card
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
DRESULT SDIO_Driver::FatFS_Write(const uint8_t* pBuffer, uint32_t Sector, uint8_t NumberOfBlocks)
{
    // Prepare the DMA Transfer
    this->StartBlockTransfert(DMA2_Stream6, (uint32_t *)pBuffer, BLOCK_SIZE, NumberOfBlocks);

    // Write block(s) in DMA transfer mode
    if(this->WriteBlocks((uint64_t)(Sector * BLOCK_SIZE), BLOCK_SIZE, NumberOfBlocks) == SYS_READY)
    {
        // Wait until transfer is complete
        if(this->CheckOperation(SDMMC_STA_TXACT) == SYS_READY)
        {
            return RES_OK;
        }
    }

    return RES_ERROR;
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: FatFS_IO_Control
//
//   Parameter(s):  uint8_t    Control        Control code
//                    void*      pBuffer        Buffer to send/receive control data
//   Return value:  DRESULT
//
//   Description:   Control
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
#if _USE_IOCTL == 1
DRESULT SDIO_Driver::FatFS_IO_Control(uint8_t Control, void *pBuffer)
{
    DRESULT     Result;
//  uint8_t     b;
    //uint8_t*    pPtr = (uint8_t*)pBuffer;
    //uint32_t    Data;
    //uint32_t*   dp;
    //uint32_t    st;
    //uint32_t    ed;


    if(m_CardStatus == STA_NOINIT)
    {
        return RES_NOTRDY;
    }

    Result = RES_ERROR;

    switch(Control)
    {
        // Make sure that all data has been written on the media
        case CTRL_SYNC:
        {
            Result = RES_OK;
            break;
        }

        // Get number of sectors on the disk (uint32_t)
        case GET_SECTOR_COUNT:
        {
            this->GetCardInfo();
            *(DWORD *)pBuffer = m_CardCapacity / BLOCK_SIZE;
            Result = RES_OK;
            break;
        }

        // Get sectors on the disk (uint16_t)
        case GET_SECTOR_SIZE:
        {
            *(WORD *)pBuffer = BLOCK_SIZE;
            Result = RES_OK;
            break;
        }

        // Get erase block size in unit of sectors (uint32_t)
        case GET_BLOCK_SIZE:
        {
            *(DWORD*)pBuffer = BLOCK_SIZE;
            break;
        }

/*        // Erase a block of sectors
        case CTRL_ERASE_SECTOR:
        {

            if(!(m_CardType & HIGH_CAPACITY_SD_CARD) || (((m_CardCSD[0].u_8.u0 >> 6) == 0) && ((m_CardCSD[2].u_8.u2 & 0x40) == 0)))
            {
                break;                                                              // Check if sector erase can be applied to the card
            }

