aroyer-qc/GRBL_Digini_STM32Fx/module/Digini/Peripheral/src/port/STM32F7xx/lib_class_STM32F7_sdio.cpp
            dp = (uint32_t*)pBuffer;
            st = dp[0];
            ed = dp[1];

/SDIO_Driver/ TODO need to check this
        //    if(!(m_CardType & CT_BLOCK))
        //    {
        //       st *= 512;
        //       ed *= 512;
        //    }

            if((this->SendCommand((CMD32 | SD_SHORT_RESPONSE), st, R1_RESPONSE, &m_Response[0]) == SYS_READY) &&
               (this->SendCommand((CMD33 | SD_SHORT_RESPONSE), ed, R1_RESPONSE, &m_Response[0]) == SYS_READY) &&
               (this->SendCommand((CMD38 | SD_SHORT_RESPONSE), 0,  R1_RESPONSE, &m_Response[0]) == SYS_READY) &&
               (WaitReady(30000) == SYS_READY))
            {
                Result = RES_OK;
            }
            break;
        }

        // Get card type flags (1 byte)
        case MMC_GET_TYPE:
        {
            *pPtr = m_CardType;
            Result = RES_OK;
            break;
        }

        case GET_CSD:                                                               // Get CSD (16 bytes)
        {
            memcpy(pPtr, m_CardCSD, 16);
            Result = RES_OK;
            break;
        }

        case MMC_GET_CID:                                                           // Get CID (16 bytes)
        {
            memcpy(pPtr, m_CardCID, 16);
            Result = RES_OK;
            break;
        }

        case MMC_GET_OCR:                                                           // Get OCR (4 bytes)
        {
            memcpy(pPtr, &m_OCR, 4);
            Result = RES_OK;
            break;
        }

        // Receive SD status as a data block (64 bytes)

        case MMC_GET_SDSTAT:
            if(m_CardType & CT_SDC)                                                 // SDC
            {
                if(WaitReady(500))
                {

                    m_pDriver->ReadyReception(1, 64);                                          // Ready to receive data blocks
                    if((This->SendCommand((ACMD13 | SD_SHORT_RESPONSE), 0, R1_RESPONSE, &m_Response[0]) == true) &&
                       (m_Response[0] & 0xC0580000) == 0)                           // Start to read
                    {
                        while((MCI_dwXferWp == 0) && ((MCI_byXferStat & 0xC) == 0) && (m_Detect == DEVICE_PRESENT));

                        if((MCI_byXferStat & 0xC) == 0)
                        {
                            LIB_memcpy(pBuffer, DmaBuff[0], 64);                   // Copy_al2un(buff, DmaBuff[0], 64);
                            Result = RES_OK;
                        }
                    }

                }
                //StopTransfert();                                                // Close data path
            }
            break;
*/
        default:
            Result = RES_PARERR;
    }

    return Result;
}
#endif

//-------------------------------------------------------------------------------------------------
//
//   Function name: FATFS_GetDriveSize
//
//   Parameter(s):  char*           pDriveName
//   Return value:  FATFS_Size_t*   SizeStruct
//   Return value:  FRESULT
//
//   Description:   Get response from SD device
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
FRESULT SDIO_Driver::FatFS_GetDriveSize(char* pDriveName, FatFS_Size_t* SizeStruct)
{
    FATFS*  pFS;
    DWORD   FreeCluster;
    FRESULT Result;

    // Get volume information and free clusters of drive
    if((Result = f_getfree(pDriveName, &FreeCluster, &pFS)) == FR_OK)
    {
        // Get total sectors and free sectors
        SizeStruct->Total = (pFS->n_fatent - 2) * pFS->csize * 0.5;
        SizeStruct->Free = FreeCluster * pFS->csize * 0.5;
    }

    return Result;
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: GetResponse
//
//   Parameter(s):  uint32_t*       pResponse
//   Return value:  SystemState_e
//
//   Description:   Get response from SD device
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
SystemState_e SDIO_Driver::GetResponse(uint32_t* pResponse)
{
    pResponse[0] = SDMMC1->RESP1;
    pResponse[1] = SDMMC1->RESP2;
    pResponse[2] = SDMMC1->RESP3;
    pResponse[3] = SDMMC1->RESP4;

    return SYS_READY;
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: TickHook
//
//   Parameter(s):  None
//   Return Value:  None
//
//   Description:   Call by the high level SD Card class
//
//   Note(s):       Do not put in OS tick hook
//
//-------------------------------------------------------------------------------------------------
void SDIO_Driver::TickHook(void)
{
    m_TickPeriod--;
    if(m_TickPeriod == 0)
    {
    }
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       SetBusWidth
//
//  Parameter(s):   uint32_t        WideMode
//  Return:         SystemState_e   State
//
//  Description:    Set the bus width of the SDMMC module
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
SystemState_e SDIO_Driver::SetBusWidth(uint32_t WideMode)
{
    SystemState_e State;
    uint32_t      Temp;
    uint32_t      SCR[2] = {0, 0};

    // MMC Card does not support this feature
    if(m_CardType == SD_MULTIMEDIA)
    {
        State = SYS_UNSUPPORTED_FEATURE;
    }
    else if((m_CardType == SD_STD_CAPACITY_V1_1) || (m_CardType == SD_STD_CAPACITY_V2_0) ||\
            (m_CardType == SD_HIGH_CAPACITY))
    {
        if(WideMode == SD_BUS_WIDE_8B)
        {
            State = SYS_UNSUPPORTED_FEATURE;
        }
        else if((WideMode == SD_BUS_WIDE_4B) ||
                (WideMode == SD_BUS_WIDE_1B))
        {
            if((SDMMC1->RESP1 & SD_CARD_LOCKED) != SD_CARD_LOCKED)
            {
                // Get SCR Register
                if((State = this->FindSCR(SCR)) == SYS_READY)
                {
                    Temp = (WideMode == SD_BUS_WIDE_4B) ? SD_WIDE_BUS_SUPPORT : SD_SINGLE_BUS_SUPPORT;

