aroyer-qc/GRBL_Digini_STM32Fx/module/Digini/Peripheral/src/port/STM32F7xx/lib_class_STM32F7_sdio.cpp
                    // If requested card supports wide bus operation
                    if((SCR[1] & Temp) != SD_ALLZERO)
                    {
                        // Send CMD55 APP_CMD with argument as card's RCA.
                        if((State = this->TransmitCommand((CMD55 | SD_SHORT_RESPONSE), m_RCA, 1)) == SYS_READY)
                        {
                            Temp = (WideMode == SD_BUS_WIDE_4B) ? 2 : 0;

                            // Send ACMD6 APP_CMD with argument as 2 for wide bus mode
                            State =  this->TransmitCommand((CMD6 | SD_SHORT_RESPONSE), Temp, 1);
                        }
                    }
                    else
                    {
                        State = SYS_REQUEST_NOT_APPLICABLE;
                    }
                }
            }
            else
            {
                State = SYS_LOCK_UNLOCK_FAILED;
            }
        }
        else
        {
            State = SYS_INVALID_PARAMETER;  // WideMode is not a valid argument
        }

        if(State == SYS_READY)
        {
            // Configure the SDMMC peripheral
            SDMMC1->CLKCR &= ~(uint32_t)CLKCR_CLEAR_MASK;
            SDMMC1->CLKCR |=  (uint32_t)WideMode;
        }
    }

    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: TransmitCommand
//
//   Parameter(s):  uint8_t         Command
//                    uint32_t        Argument
//                    ResponseType_e  ResponseType
//   Return value:  SystemState_e
//
//   Description:   Send command to the SD Card
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
SystemState_e SDIO_Driver::TransmitCommand(uint8_t Command, uint32_t Argument, int32_t ResponseType)
{
    SystemState_e   State;

    ClearAllFlag();                                                     // Clear the Command Flags
    SDMMC1->ARG = (uint32_t)Argument;                                   // Set the SDMMC Argument value
    SDMMC1->CMD = (uint32_t)(Command | SDMMC_CMD_CPSMEN);               // Set SDMMC command parameters
    m_LastCommand = Command;
    if((Argument == 0) && (ResponseType == 0)) ResponseType = -1;       // Go idle command
    State = this->CmdResponse(Command & SDMMC_CMD_CMDINDEX, ResponseType);
    ClearAllFlag();                                                     // Clear the Command Flags

    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: CheckOCR_Response
//
//   Parameter(s):  uint32_t        Response_R1      OCR Response code
//   Return value:  SystemState_e
//
//   Description:   Analyze the OCR response and return the appropriate error code
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
SystemState_e SDIO_Driver::CheckOCR_Response(uint32_t Response_R1)
{
    if((Response_R1 & SD_OCR_ERRORBITS)             == SD_ALLZERO)                  return SYS_READY;
    if((Response_R1 & SD_OCR_ADDR_OUT_OF_RANGE)     == SD_OCR_ADDR_OUT_OF_RANGE)    return SYS_OUT_OF_RANGE;
    if((Response_R1 & SD_OCR_ADDR_MISALIGNED)       == SD_OCR_ADDR_MISALIGNED)      return SYS_ADDRESS_MISALIGNED;
    if((Response_R1 & SD_OCR_BLOCK_LEN_ERR)         == SD_OCR_BLOCK_LEN_ERR)        return SYS_BLOCK_LENGTH_ERROR;
    if((Response_R1 & SD_OCR_ERASE_SEQ_ERR)         == SD_OCR_ERASE_SEQ_ERR)        return SD_ERASE_SEQ_ERR;
    if((Response_R1 & SD_OCR_BAD_ERASE_PARAM)       == SD_OCR_BAD_ERASE_PARAM)      return SD_BAD_ERASE_PARAM;
    if((Response_R1 & SD_OCR_WRITE_PROT_VIOLATION)  == SD_OCR_WRITE_PROT_VIOLATION) return SD_WRITE_PROT_VIOLATION;
    if((Response_R1 & SD_OCR_LOCK_UNLOCK_FAILED)    == SD_OCR_LOCK_UNLOCK_FAILED)   return SYS_LOCK_UNLOCK_FAILED;
    if((Response_R1 & SD_OCR_COM_CRC_FAILED)        == SD_OCR_COM_CRC_FAILED)       return SYS_CRC_FAIL;
    if((Response_R1 & SD_OCR_ILLEGAL_CMD)           == SD_OCR_ILLEGAL_CMD)          return SYS_ILLEGAL_COMMAND;
    if((Response_R1 & SD_OCR_CARD_ECC_FAILED)       == SD_OCR_CARD_ECC_FAILED)      return SD_CARD_ECC_FAILED;
    if((Response_R1 & SD_OCR_CC_ERROR)              == SD_OCR_CC_ERROR)             return SD_CC_ERROR;
    if((Response_R1 & SD_OCR_GENERAL_UNKNOWN_ERROR) == SD_OCR_GENERAL_UNKNOWN_ERROR)return SYS_GENERAL_UNKNOWN_ERROR;
    if((Response_R1 & SD_OCR_STREAM_READ_UNDERRUN)  == SD_OCR_STREAM_READ_UNDERRUN) return SYS_UNDERRUN;
    if((Response_R1 & SD_OCR_STREAM_WRITE_OVERRUN)  == SD_OCR_STREAM_WRITE_OVERRUN) return SYS_OVERRUN;
    if((Response_R1 & SD_OCR_CID_CSD_OVERWRITE)     == SD_OCR_CID_CSD_OVERWRITE)    return SD_CID_CSD_OVERWRITE;
    if((Response_R1 & SD_OCR_WP_ERASE_SKIP)         == SD_OCR_WP_ERASE_SKIP)        return SD_WP_ERASE_SKIP;
    if((Response_R1 & SD_OCR_CARD_ECC_DISABLED)     == SD_OCR_CARD_ECC_DISABLED)    return SD_CARD_ECC_DISABLED;
    if((Response_R1 & SD_OCR_ERASE_RESET)           == SD_OCR_ERASE_RESET)          return SD_ERASE_RESET;
    if((Response_R1 & SD_OCR_AKE_SEQ_ERROR)         == SD_OCR_AKE_SEQ_ERROR)        return SD_AKE_SEQ_ERROR;

    return SYS_READY;
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: CmdResponse
//
//   Parameter(s):  uint8_t             Command
//                    uint32_t            Argument
//                    SD_ResponseType_e   ResponseType
//   Return value:  SystemState_e
//
//   Description:   Checks for error conditions for any response.
//                              - R0, R1, R6, R7
//                              - R2 (CID or CSD) response.
//                              - R3 (OCR) response.
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
SystemState_e SDIO_Driver::CmdResponse(uint8_t Command, int32_t ResponseType)
{
    uint32_t Response_R1;
    uint32_t TimeOut;
    uint32_t Flag;

    if(ResponseType == -1) Flag = SDMMC_STA_CMDSENT;
    else                   Flag = SDMMC_STA_CCRCFAIL | SDMMC_STA_CMDREND | SDMMC_STA_CTIMEOUT;

    TimeOut = SD_SOFTWARE_COMMAND_TIMEOUT;
    do
    {
        TimeOut--;
    }
    while(((SDMMC1->STA & Flag) == 0) && (TimeOut > 0));

    if(ResponseType <= 0)
    {
        if(TimeOut == 0)                            return SYS_COMMAND_TIME_OUT;
        else                                        return SYS_READY;
    }

    if((SDMMC1->STA & SDMMC_STA_CTIMEOUT) != 0)     return SYS_COMMAND_TIME_OUT;
    if(ResponseType == 3)
    {
        if(TimeOut == 0)                            return SYS_COMMAND_TIME_OUT;    // Card is not V2.0 compliant or card does not support the set voltage range
        else                                        return SYS_READY;               // Card is SD V2.0 compliant
    }
    if((SDMMC1->STA & SDMMC_STA_CCRCFAIL) != 0)     return SYS_CRC_FAIL;
    if(ResponseType == 2)                           return SYS_READY;
    if((uint8_t)SDMMC1->RESPCMD != Command)         return SYS_ILLEGAL_COMMAND;     // Check if response is of desired command

