aroyer-qc/GRBL_Digini_STM32Fx/module/Digini/Peripheral/src/port/STM32F7xx/lib_class_STM32F7_sdio.cpp
    Response_R1 = SDMMC1->RESP1;                                                    // We have received response, retrieve it for analysis

    if(ResponseType == 1)
    {
        return this->CheckOCR_Response(Response_R1);
    }
    else if(ResponseType == 6)
    {
        if((Response_R1 & (SD_R6_GENERAL_UNKNOWN_ERROR | SD_R6_ILLEGAL_CMD | SD_R6_COM_CRC_FAILED)) == SD_ALLZERO)
        {
            m_RCA = Response_R1;
        }
        if((Response_R1 & SD_R6_GENERAL_UNKNOWN_ERROR) == SD_R6_GENERAL_UNKNOWN_ERROR)      return SYS_GENERAL_UNKNOWN_ERROR;
        if((Response_R1 & SD_R6_ILLEGAL_CMD)           == SD_R6_ILLEGAL_CMD)                return SYS_ILLEGAL_COMMAND;
        if((Response_R1 & SD_R6_COM_CRC_FAILED)        == SD_R6_COM_CRC_FAILED)             return SYS_CRC_FAIL;
    }

    return SYS_READY;
}

//-------------------------------------------------------------------------------------------------
//
//  ****  ****  * *   *   *  ***** *****
//  *   * *   * * *   *  * *   *   *
//  ****  ****  * *   * *   *  *   ****
//  *     *  *  *  * *  *****  *   *
//  *     *   * *   *   *   *  *   *****
//
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
//
//   Function:      IsDetected
//
//   Parameter(s):  None
//   Return Value:  SystemState_e       Return
//
//   Description:   Test if card is present
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
SystemState_e SDIO_Driver::IsDetected(void)
{
  #if SD_CARD_USE_DETECT_SIGNAL == 1
    return (IO_Input(DIGINI_SD_CARD_DETECT_IO) == IO_RESET) ? SYS_READY : SYS_DEVICE_NOT_PRESENT;
  #else
    return SYS_READY;
  #endif
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      Lock
//
//   Parameter(s):  None
//   Return Value:  None
//
//   Description:   Lock the driver
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
void SDIO_Driver::Lock(void)
{
    while(nOS_MutexLock(&m_Mutex, NOS_WAIT_INFINITE) != NOS_OK) {};
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      Unlock
//
//   Parameter(s):
//   Return Value:
//
//   Description:   Unlock the driver
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
void SDIO_Driver::Unlock(void)
{
    nOS_MutexUnlock(&m_Mutex);
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      SD_PowerON
//
//   Parameter(s):  None
//   Return Value:  SystemState_e
//
//   Description:   Inquires cards about their operating voltage and configures clock
//                  controls and stores SD information that will be needed in future.
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
SystemState_e SDIO_Driver::PowerON(void)
{
    SystemState_e   State;
    uint32_t        Response;
    uint32_t        Count        = 0;
    uint32_t        ValidVoltage = 0;
    uint32_t        SD_Type       = SD_RESP_STD_CAPACITY;
    nOS_TickCounter TickStart;

    // Power ON Sequence -------------------------------------------------------
    SDMMC1->CLKCR &= ~SDMMC_CLKCR_CLKEN;        // Disable SDMMC Clock
    SDMMC1->POWER  = SDMMC_POWER_PWRCTRL;       // Set Power State to ON

    // 1ms: required power up waiting time before starting the SD initialization sequence
    TickStart = nOS_GetTickCount();
    while((nOS_GetTickCount() - TickStart) < 1){}

    SDMMC1->CLKCR |= SDMMC_CLKCR_CLKEN;           // Enable SDMMC Clock

    // CMD0: GO_IDLE_STATE -----------------------------------------------------
    // No CMD Response required
    if((State = this->TransmitCommand(CMD0, 0, 0)) != SYS_READY)
    {
        // CMD Response Timeout (wait for CMDSENT flag)
        return State;
    }

    // CMD8: SEND_IF_COND ------------------------------------------------------
    // Send CMD8 to verify SD card interface operating condition
    // Argument: - [31:12]: Reserved (shall be set to '0')
    //- [11:8]: Supply Voltage (VHS) 0x1 (Range: 2.7-3.6 V)
    //- [7:0]: Check Pattern (recommended 0xAA)
    // CMD Response: R7
    if((State = this->TransmitCommand((CMD8 | SD_SHORT_RESPONSE), SD_CHECK_PATTERN, 7)) == SYS_READY)
    {
        // SD Card 2.0
        m_CardType = SD_STD_CAPACITY_V2_0;
        SD_Type    = SD_RESP_HIGH_CAPACITY;
    }

    // Send CMD55
    // If State is Command Timeout, it is a MMC card
    // If State is SYS_READY it is a SD card: SD card 2.0 (voltage range mismatch) or SD card 1.x
    if((State = this->TransmitCommand((CMD55 | SD_SHORT_RESPONSE), 0, 1)) == SYS_READY)
    {
        // SD CARD
        // Send ACMD41 SD_APP_OP_COND with Argument 0x80100000
        while((ValidVoltage == false) && (Count < SD_MAX_VOLT_TRIAL))
        {

            // SEND CMD55 APP_CMD with RCA as 0
            if((State = this->TransmitCommand((CMD55 | SD_SHORT_RESPONSE), 0, 1)) != SYS_READY)
            {
                return State;
            }

            // Send CMD41
            if((State = this->TransmitCommand((CMD41 | SD_SHORT_RESPONSE), SD_VOLTAGE_WINDOW | SD_Type, 3)) != SYS_READY)
            {
                return State;
            }

            Response = SDMMC1->RESP1;                               // Get command response
            ValidVoltage = (((Response >> 31) == 1) ? 1 : 0);       // Get operating voltage
            Count++;
        }

        if(Count >= SD_MAX_VOLT_TRIAL)
        {
            return SYS_INVALID_VOLTAGE_RANGE;
        }

        if((Response & SD_RESP_HIGH_CAPACITY) == SD_RESP_HIGH_CAPACITY)
        {
            m_CardType = SD_HIGH_CAPACITY;
        }
    } // else MMC Card

