aroyer-qc/GRBL_Digini_STM32Fx/module/Digini/Peripheral/src/port/STM32F7xx/lib_class_STM32F7_sdio.cpp
    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      SD_PowerON
//
//   Parameter(s):  None
//   Return Value:  None
//
//   Description:   Put interface in power OFF
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
void SDIO_Driver::PowerOFF(void)
{
    // Set Power State to OFF
    SDMMC1->POWER = (uint32_t)0;

    // Reset SDIO Module
    RCC->APB2RSTR |=  RCC_APB2RSTR_SDMMC1RST;
    RCC->APB2RSTR &= ~RCC_APB2RSTR_SDMMC1RST;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      SD_InitializeCard
//
//   Parameter(s):  None
//   Return Value:  SystemState_e
//
//   Description:   Initializes all cards or single card as the case may be Card(s) come into standby state.
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
SystemState_e SDIO_Driver::InitializeCard(void)
{
    SystemState_e State;

    if((SDMMC1->POWER & SDMMC_POWER_PWRCTRL) != 0) // Power off
    {
        if(m_CardType != SD_SECURE_DIGITAL_IO)
        {
            // Send CMD2 ALL_SEND_CID
            if((State = this->TransmitCommand((CMD2 | SD_LONG_RESPONSE), 0, 2)) != SYS_READY)
            {
                return State;
            }

            // Get Card identification number data
            this->GetResponse(m_CardCID);
        }

        if((m_CardType == SD_STD_CAPACITY_V1_1)       || (m_CardType == SD_STD_CAPACITY_V2_0) ||
           (m_CardType == SD_SECURE_DIGITAL_IO_COMBO) || (m_CardType == SD_HIGH_CAPACITY))
        {
            // Send CMD3 SET_REL_ADDR with argument 0
            // SD Card publishes its RCA.
            if((State = this->TransmitCommand((CMD3 | SD_SHORT_RESPONSE), 0, 6)) != SYS_READY)
            {
                return State;
            }
        }

        if(m_CardType != SD_SECURE_DIGITAL_IO)
        {
            // Send CMD9 SEND_CSD with argument as card's RCA
            if((State = this->TransmitCommand((CMD9 | SD_LONG_RESPONSE), m_RCA, 2)) == SYS_READY)
            {
                // Get Card Specific Data
                this->GetResponse(m_CardCSD);
            }
        }
    }
    else
    {
        State = SYS_REQUEST_NOT_APPLICABLE;
    }

    // Card are initialized
    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: DataInit
//
//   Parameter(s):  uint32_t       Size
//                  uint32_t       DataBlockSize
//                  bool           IsItReadFromCard
//   Return value:  None
//
//   Description:   Configuration for SDIO Data using SDIO_DataInitTypeDef
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
void SDIO_Driver::DataInit(uint32_t Size, uint32_t DataBlockSize, bool IsItReadFromCard)
{
    uint32_t Direction;

    SDMMC1->DTIMER = SD_DATA_TIMEOUT;       // Set the SDMMC Data TimeOut value
    SDMMC1->DLEN   = Size;                  // Set the SDMMC DataLength value
    Direction      = (IsItReadFromCard == true) ? SDMMC_DCTRL_DTDIR : 0;
    SDMMC1->DCTRL |=  (uint32_t)(DataBlockSize | Direction | SDMMC_DCTRL_DTEN);
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      FindSCR
//
//   Parameter(s):  pSCR: pointer to the buffer that will contain the SCR value
//   Return Value:
//
//   Description:   Finds the SD card SCR register value.
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
SystemState_e SDIO_Driver::FindSCR(uint32_t* pSCR)
{
    SystemState_e State;
    int           Index;
    uint32_t      SCR[2];

    // Set Block Size To 8 Bytes
    // Send CMD16 Set Block length
    if((State = this->TransmitCommand((CMD16 | SD_SHORT_RESPONSE), 8, 1)) == SYS_READY)
    {
        // Send CMD55 APP_CMD with argument as card's RCA
        if((State = this->TransmitCommand((CMD55 | SD_SHORT_RESPONSE), m_RCA, 1)) == SYS_READY)
        {
            this->DataInit(8, SD_DATABLOCK_SIZE_8B, true);

            // Send ACMD51 SD_APP_SEND_SCR with argument as 0
            if((State = this->TransmitCommand((CMD51 | SD_SHORT_RESPONSE), 0, 1)) == SYS_READY)
            {
                Index = 0;
                while(((SDMMC1->STA & (SDMMC_STA_RXOVERR | SDMMC_STA_DCRCFAIL | SDMMC_STA_DTIMEOUT | SDMMC_STA_DBCKEND)) == 0) &&
                      (Index < 2))
                {
                    if((SDMMC1->STA & SDMMC_STA_RXDAVL) != 0)
                    {
                      *(SCR + Index) = SDMMC1->FIFO;
                      Index++;
                    }
                }

                if     ((SDMMC1->STA & SDMMC_STA_DTIMEOUT) != 0) State = SYS_DATA_TIME_OUT;
                else if((SDMMC1->STA & SDMMC_STA_DCRCFAIL) != 0) State = SYS_CRC_FAIL;
                else if((SDMMC1->STA & SDMMC_STA_RXOVERR)  != 0) State = SYS_OVERRUN;
                else if((SDMMC1->STA & SDMMC_STA_RXDAVL)   != 0) State = SYS_OUT_OF_BOUND;
                else
                {
                    *(pSCR + 1) = ((SCR[0] & 0x000000FF) << 24) | ((SCR[0] & 0x0000FF00) << 8) |
                                  ((SCR[0] & 0x00FF0000) >> 8)  | ((SCR[0] & 0xFF000000) >> 24);

                    *(pSCR)     = ((SCR[1] & 0x000000FF) << 24) | ((SCR[1] & 0x0000FF00) << 8) |
                                  ((SCR[1] & 0x00FF0000) >> 8)  | ((SCR[1] & 0xFF000000) >> 24);
                }
            }
        }
    }

    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: GetStatus
//
//   Parameter(s):  None
//   Return value:  SystemState_e
//
//   Description:   Returns information about specific card.
//                  Contains all SD card information
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
SystemState_e SDIO_Driver::GetCardInfo(void)
{
    SystemState_e State;
    uint32_t      Temp;

    State = SYS_READY;

    // Byte 0
    Temp = (m_CardCSD[0] & 0xFF000000) >> 24;
    m_CSD.CSDStruct      = (uint8_t)((Temp & 0xC0) >> 6);
    m_CSD.SysSpecVersion = (uint8_t)((Temp & 0x3C) >> 2);
    m_CSD.Reserved1      = Temp & 0x03;

    // Byte 1
    Temp = (m_CardCSD[0] & 0x00FF0000) >> 16;
    m_CSD.TAAC = (uint8_t)Temp;

    // Byte 2
    Temp = (m_CardCSD[0] & 0x0000FF00) >> 8;
    m_CSD.NSAC = (uint8_t)Temp;

    // Byte 3
    Temp = m_CardCSD[0] & 0x000000FF;
    m_CSD.MaxBusClkFrec = (uint8_t)Temp;

