aroyer-qc/GRBL_Digini_STM32Fx/module/Digini/Peripheral/src/port/STM32F7xx/lib_class_STM32F7_sdio.cpp
    // Byte 4
    Temp = (m_CardCSD[1] & 0xFF000000) >> 24;
    m_CSD.CardComdClasses = (uint16_t)(Temp << 4);

    // Byte 5
    Temp = (m_CardCSD[1] & 0x00FF0000) >> 16;
    m_CSD.CardComdClasses |= (uint16_t)((Temp & 0xF0) >> 4);
    m_CSD.RdBlockLen       = (uint8_t)(Temp & 0x0F);

    // Byte 6
    Temp = (m_CardCSD[1] & 0x0000FF00) >> 8;
    m_CSD.PartBlockRead   = (uint8_t)((Temp & 0x80) >> 7);
    m_CSD.WrBlockMisalign = (uint8_t)((Temp & 0x40) >> 6);
    m_CSD.RdBlockMisalign = (uint8_t)((Temp & 0x20) >> 5);
    m_CSD.DSRImpl         = (uint8_t)((Temp & 0x10) >> 4);
    m_CSD.Reserved2       = 0;

    if((m_CardType == SD_STD_CAPACITY_V1_1) || (m_CardType == SD_STD_CAPACITY_V2_0))
    {
        m_CSD.DeviceSize = (Temp & 0x03) << 10;

        // Byte 7
        Temp = (uint8_t)(m_CardCSD[1] & 0x000000FF);
        m_CSD.DeviceSize |= (Temp) << 2;

        // Byte 8
        Temp = (uint8_t)((m_CardCSD[2] & 0xFF000000) >> 24);
        m_CSD.DeviceSize |= (Temp & 0xC0) >> 6;

        m_CSD.MaxRdCurrentVDDMin = (Temp & 0x38) >> 3;
        m_CSD.MaxRdCurrentVDDMax = (Temp & 0x07);

        // Byte 9
        Temp = (uint8_t)((m_CardCSD[2] & 0x00FF0000) >> 16);
        m_CSD.MaxWrCurrentVDDMin = (Temp & 0xE0) >> 5;
        m_CSD.MaxWrCurrentVDDMax = (Temp & 0x1C) >> 2;
        m_CSD.DeviceSizeMul      = (Temp & 0x03) << 1;

        // Byte 10
        Temp = (uint8_t)((m_CardCSD[2] & 0x0000FF00) >> 8);
        m_CSD.DeviceSizeMul |= (Temp & 0x80) >> 7;

        m_CardCapacity  = (m_CSD.DeviceSize + 1) ;
        m_CardCapacity *= (1 << (m_CSD.DeviceSizeMul + 2));
        m_CardBlockSize = 1 << (m_CSD.RdBlockLen);
        m_CardCapacity *= m_CardBlockSize;
    }
    else if(m_CardType == SD_HIGH_CAPACITY)
    {
        // Byte 7
        Temp = (uint8_t)(m_CardCSD[1] & 0x000000FF);
        m_CSD.DeviceSize = (Temp & 0x3F) << 16;

        // Byte 8
        Temp = (uint8_t)((m_CardCSD[2] & 0xFF000000) >> 24);

        m_CSD.DeviceSize |= (Temp << 8);

        // Byte 9
        Temp = (uint8_t)((m_CardCSD[2] & 0x00FF0000) >> 16);

        m_CSD.DeviceSize |= (Temp);

        // Byte 10
        Temp = (uint8_t)((m_CardCSD[2] & 0x0000FF00) >> 8);

        m_CardCapacity  = ((m_CSD.DeviceSize + 1)) * 512 * 1024;
        m_CardBlockSize = 512;
    }
    else
    {
        // Not supported card type
        State = SYS_ERROR;
    }

    m_CSD.EraseGrSize = (Temp & 0x40) >> 6;
    m_CSD.EraseGrMul  = (Temp & 0x3F) << 1;

    // Byte 11
    Temp = (uint8_t)(m_CardCSD[2] & 0x000000FF);
    m_CSD.EraseGrMul     |= (Temp & 0x80) >> 7;
    m_CSD.WrProtectGrSize = (Temp & 0x7F);

    // Byte 12
    Temp = (uint8_t)((m_CardCSD[3] & 0xFF000000) >> 24);
    m_CSD.WrProtectGrEnable = (Temp & 0x80) >> 7;
    m_CSD.ManDeflECC        = (Temp & 0x60) >> 5;
    m_CSD.WrSpeedFact       = (Temp & 0x1C) >> 2;
    m_CSD.MaxWrBlockLen     = (Temp & 0x03) << 2;

    // Byte 13
    Temp = (uint8_t)((m_CardCSD[3] & 0x00FF0000) >> 16);
    m_CSD.MaxWrBlockLen      |= (Temp & 0xC0) >> 6;
    m_CSD.WriteBlockPaPartial = (Temp & 0x20) >> 5;
    m_CSD.Reserved3           = 0;
    m_CSD.ContentProtectAppli = (Temp & 0x01);

    // Byte 14
    Temp = (uint8_t)((m_CardCSD[3] & 0x0000FF00) >> 8);
    m_CSD.FileFormatGrouop = (Temp & 0x80) >> 7;
    m_CSD.CopyFlag         = (Temp & 0x40) >> 6;
    m_CSD.PermWrProtect    = (Temp & 0x20) >> 5;
    m_CSD.TempWrProtect    = (Temp & 0x10) >> 4;
    m_CSD.FileFormat       = (Temp & 0x0C) >> 2;
    m_CSD.ECC              = (Temp & 0x03);

    // Byte 15
    Temp = (uint8_t)(m_CardCSD[3] & 0x000000FF);
    m_CSD.CSD_CRC   = (Temp & 0xFE) >> 1;
    m_CSD.Reserved4 = 1;

    // Byte 0
    Temp = (uint8_t)((m_CardCID[0] & 0xFF000000) >> 24);
    m_CID.ManufacturerID = Temp;

    // Byte 1
    Temp = (uint8_t)((m_CardCID[0] & 0x00FF0000) >> 16);
    m_CID.OEM_AppliID = Temp << 8;

    // Byte 2
    Temp = (uint8_t)((m_CardCID[0] & 0x000000FF00) >> 8);
    m_CID.OEM_AppliID |= Temp;

    // Byte 3
    Temp = (uint8_t)(m_CardCID[0] & 0x000000FF);
    m_CID.ProdName1 = Temp << 24;

    // Byte 4
    Temp = (uint8_t)((m_CardCID[1] & 0xFF000000) >> 24);
    m_CID.ProdName1 |= Temp << 16;

    // Byte 5
    Temp = (uint8_t)((m_CardCID[1] & 0x00FF0000) >> 16);
    m_CID.ProdName1 |= Temp << 8;

    // Byte 6
    Temp = (uint8_t)((m_CardCID[1] & 0x0000FF00) >> 8);
    m_CID.ProdName1 |= Temp;

    // Byte 7
    Temp = (uint8_t)(m_CardCID[1] & 0x000000FF);
    m_CID.ProdName2 = Temp;

    // Byte 8
    Temp = (uint8_t)((m_CardCID[2] & 0xFF000000) >> 24);
    m_CID.ProdRev = Temp;

    // Byte 9
    Temp = (uint8_t)((m_CardCID[2] & 0x00FF0000) >> 16);
    m_CID.ProdSN = Temp << 24;

    // Byte 10
    Temp = (uint8_t)((m_CardCID[2] & 0x0000FF00) >> 8);
    m_CID.ProdSN |= Temp << 16;

    // Byte 11
    Temp = (uint8_t)(m_CardCID[2] & 0x000000FF);
    m_CID.ProdSN |= Temp << 8;

    // Byte 12
    Temp = (uint8_t)((m_CardCID[3] & 0xFF000000) >> 24);
    m_CID.ProdSN |= Temp;

    // Byte 13
    Temp = (uint8_t)((m_CardCID[3] & 0x00FF0000) >> 16);
    m_CID.Reserved1   |= (Temp & 0xF0) >> 4;
    m_CID.ManufactDate = (Temp & 0x0F) << 8;

    // Byte 14
    Temp = (uint8_t)((m_CardCID[3] & 0x0000FF00) >> 8);
    m_CID.ManufactDate |= Temp;

    // Byte 15
    Temp = (uint8_t)(m_CardCID[3] & 0x000000FF);
    m_CID.CID_CRC   = (Temp & 0xFE) >> 1;
    m_CID.Reserved2 = 1;

    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: StartBlockTransfert
//
//   Parameter(s):  DMA_Stream_TypeDef* pDMA            DMA Stream to use for the DMA operation
//                  uint64_t            pBuffer         Pointer to/for the buffer the data
//                  uint32_t            BlockSize       The SD card Data block size
//                  uint32_t            NumberOfBlocks  Number of blocks to access
//   Return value:  SystemState_e
//
//   Description:   Prepare the DMA transfer
//
//   note(s):       This should be preceding the functions WriteBlocks() or ReadBlocks()
//                  completion of the write process (by SD current status polling).
//
//-------------------------------------------------------------------------------------------------
void SDIO_Driver::StartBlockTransfert(DMA_Stream_TypeDef* pDMA, uint32_t* pBuffer, uint32_t BlockSize, uint32_t NumberOfBlocks)
{
    SDMMC1->DCTRL      = 0;                                                                 // Initialize data control register
    m_TransferComplete = false;                                                                 // Initialize handle flags
    m_DMA_XferComplete = false;
    m_TransferError    = SYS_READY;
    m_Operation        = (NumberOfBlocks > 1) ? SD_MULTIPLE_BLOCK : SD_SINGLE_BLOCK;        // Initialize SD Read operation
    SDMMC1->MASK      |= (SDMMC_MASK_DCRCFAILIE | SDMMC_MASK_DTIMEOUTIE |                   // Enable transfer interrupts
                          SDMMC_MASK_DATAENDIE  | SDMMC_MASK_RXOVERRIE);
    SDMMC1->DCTRL     |= SDMMC_DCTRL_DMAEN;                                                 // Enable SDMMC DMA transfer
    pDMA->CR          &= ~DMA_SxCR_EN;                                                      // Disable the Peripheral
    pDMA->NDTR         = (uint32_t)(BlockSize * NumberOfBlocks) / 4;                        // Configure DMA Stream data length
    pDMA->M0AR         = (uint32_t)pBuffer;                                                 // Configure DMA Stream memory address
    pDMA->CR          |= DMA_SxCR_TCIE | DMA_SxCR_HTIE | DMA_SxCR_TEIE | DMA_SxCR_DMEIE;    // Enable all interrupts
    pDMA->FCR         |= DMA_SxFCR_FEIE;
    pDMA->CR          |= DMA_SxCR_EN;                                                       // Enable the Peripheral
}

//-------------------------------------------------------------------------------------------------
//
//   Function name: ReadBlocks
//
//   Parameter(s):  uint64_t ReadAddress
//                  uint32_t BlockSize
//                  uint32_t NumberOfBlocks
//   Return value:  SystemState_e
//
//   Description:   Reads block(s) from a specified address in a card. The Data transfer is managed
//                  by DMA mode.
//
//   note(s):       This API should be followed by the function CheckOperation() to check the
//                  completion of the write process (by SD current status polling).
//
//-------------------------------------------------------------------------------------------------
SystemState_e SDIO_Driver::ReadBlocks(uint64_t ReadAddress, uint32_t BlockSize, uint32_t NumberOfBlocks)
{
    SystemState_e State;
    uint32_t      CmdIndex;

